// https://en.wikipedia.org/wiki/Hiragana#Table_of_hiragana

export const hiragana = {
	gojuon: [
		["あ", "い", "う", "え", "お"],
		["か", "き", "く", "け", "こ"],
		["さ", "し", "す", "せ", "そ"],
		["た", "ち", "つ", "て", "と"],
		["な", "に", "ぬ", "ね", "の"],
		["は", "ひ", "ふ", "へ", "ほ"],
		["ま", "み", "む", "め", "も"],
		["や", null, "ゆ", null, "よ"],
		["ら", "り", "る", "れ", "ろ"],
		["わ", null, null, null, "を"],
		["ん"]
	],
	dakuon: [
		["が", "ぎ", "ぐ", "げ", "ご"],
		["ざ", "じ", "ず", "ぜ", "ぞ"],
		["だ", "ぢ", "づ", "で", "ど"],
		["ば", "び", "ぶ", "べ", "ぼ"],
		["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"]
	],
	yoon: [
		["きゃ", "きゅ", "きょ"],
		["しゃ", "しゅ", "しょ"],
		["ちゃ", "ちゅ", "ちょ"],
		["にゃ", "にゅ", "にょ"],
		["ひゃ", "ひゅ", "ひょ"],
		["みゃ", "みゅ", "みょ"],
		["りゃ", "りゅ", "りょ"]
	],
	dakuonYoon: [
		["ぎゃ", "ぎゅ", "ぎょ"],
		["じゃ", "じゅ", "じょ"],
		// ["ぢゃ", "ぢゅ", "ぢょ"],
		["びゃ", "びゅ", "びょ"],
		["ぴゃ", "ぴゅ", "ぴょ"]
	]
}
